In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.feature_extraction.text import CountVectorizer

/anaconda3/envs/dsi/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/anaconda3/envs/dsi/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [9]:
vals_a = [['delicious', 'cavendish', 'bing'],['fuji', 'cavendish', 'bing'],['delicious', 'little', 'bing']]
vals_b = [['big', 'green', 'red'],['little', 'snow', 'red'], ['baby', 'snap', 'kidney']]
cols_a = ['apples', 'bananas', 'cherries']
cols_b = ['carrots', 'peas', 'beans']

a = pd.DataFrame(vals_a, columns=cols_a)
b = pd.DataFrame(vals_b, columns=cols_b)

In [10]:
a

      apples    bananas cherries
0  delicious  cavendish     bing
1       fuji  cavendish     bing
2  delicious     little     bing

In [11]:
b

  carrots   peas   beans
0     big  green     red
1  little   snow     red
2    baby   snap  kidney

In [14]:
cv = CountVectorizer()

In [15]:
apples_vec = cv.fit_transform(a.apples)

In [16]:
apples_vec

<3x2 sparse matrix of type '<class 'numpy.int64'>'
	with 3 stored elements in Compressed Sparse Row format>

In [17]:
bananas_vec = cv.transform(a.bananas)

In [18]:
bananas_vec

<3x2 sparse matrix of type '<class 'numpy.int64'>'
	with 0 stored elements in Compressed Sparse Row format>

In [6]:
pd.merge(a, b, left_index=True, right_index=True)

   apples  bananas  cherries  carrots  peas  beans
0       2        4         8        1     3      5
1      10       12        14        7     9     11
2      16       18        20       13    15     17

In [7]:
#train2,test2 = train.align(test, join='outer', axis=1, fill_value=0)

In [9]:
c, d = a.align(b, fill_value=0)
c

   apples  bananas  beans  carrots  cherries  peas
0       2        4      0        0         8     0
1      10       12      0        0        14     0
2      16       18      0        0        20     0

   apples  bananas  beans  carrots  cherries  peas
0       0        0      5        1         0     3
1       0        0     11        7         0     9
2       0        0     17       13         0    15

In [23]:
a_dummies = pd.get_dummies(a)

In [24]:
b_dummies = pd.get_dummies(b)

In [26]:
a_prime, b_prime = a_dummies.align(b_dummies, fill_value=0)

In [27]:
a_prime

   apples  bananas  beans  carrots  cherries  peas
0       2        4      0        0         8     0
1      10       12      0        0        14     0
2      16       18      0        0        20     0